Documents/УпаковочныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>УпаковочныйЛист</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладУпаковки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВариантыКомплектацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ВариантыКомплектацииНоменклатуры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураОсновногоКомпонента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимости</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/УпаковочныйЛист/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	             
	// ++ Галфинд_ДомнышеваКР_06_03_2024
	ДобавляемыеРеквизиты = Новый Массив;
	ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.Партнеры");
	РеквизитФормыКлиент = Новый РеквизитФормы("гф_Клиент",  
		ТипРеквизита, , "Клиент", Истина);
						  							 
	ДобавляемыеРеквизиты.Добавить(РеквизитФормыКлиент);
		
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если ЗначениеЗаполнено(Объект.гф_Заказ) Тогда
		 ЗаполнитьКлиента();
	КонецЕсли;
	// -- Галфинд_ДомнышеваКР_06_03_2024
	
// ++ Плотников 22.06.2022
	ТипГруппаФормы = Тип("ГруппаФормы");
	ТипПолеФормы = Тип("ПолеФормы");

	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаНовыхРеквизитов", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;

	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаКомплектация", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаПодвалОбщий", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Комплектация", 
		ТипПолеФормы, 	ЭтотОбъект.Элементы.гф_ГруппаКомплектация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина = 15;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Комплектация";
	// vvv Галфинд \ Sakovich 22.10.2022
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гф_КомплектацияПриИзменении");
	// ^^^ Галфинд \ Sakovich 22.10.2022 
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ШтрихкодКороба", ТипПолеФормы,
	ЭтотОбъект.Элементы.гф_ГруппаКомплектация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина = 10;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Комплектация.гф_Штрихкод";

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_NVE_распечатан", ТипПолеФормы,
		ЭтотОбъект.Элементы.гф_ГруппаКомплектация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок = "Код (NVE) распечатан";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_NVE_распечатан";

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_NVE_назначен", ТипПолеФормы, 
		ЭтотОбъект.Элементы.гф_ГруппаКомплектация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок = "Код (NVE) назначен";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_NVE_назначен";

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_СостояниеКороба", ТипПолеФормы, 
		ЭтотОбъект.Элементы.гф_ГруппаНовыхРеквизитов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Состояние короба";
	НовыйЭлемент.ПутьКДанным = "Объект.гф_СостояниеКороба";

	Элементы.Переместить(ЭтотОбъект.Элементы.гф_ГруппаНовыхРеквизитов, ЭтотОбъект.Элементы.ШапкаЛево);
	Элементы.Переместить(ЭтотОбъект.Элементы.гф_ГруппаКомплектация, ЭтотОбъект.Элементы.гф_ГруппаНовыхРеквизитов);

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Организация", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Организация";

	Элементы.Переместить(ЭтотОбъект.Элементы.гф_Организация, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Клиент", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	// ++ Галфинд_ДомнышеваКР_06_03_2024
	//НовыйЭлемент.ПутьКДанным = "Объект.гф_Заказ.Партнер";
    НовыйЭлемент.ПутьКДанным = "гф_Клиент";
    // -- Галфинд_ДомнышеваКР_06_03_2024 
	
	Элементы.Переместить(ЭтотОбъект.Элементы.гф_Клиент, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Заказ", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Заказ";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "гф_ЗаказПриИзменении"); // Галфинд_ДомнышеваКР_06_03_2024

	Элементы.Переместить(ЭтотОбъект.Элементы.гф_Заказ, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Поставка", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Поставка";
	
	Элементы.Переместить(ЭтотОбъект.Элементы.гф_Поставка, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ГруппаАгрегация", ТипГруппаФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Агрегация", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаАгрегация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Агрегация";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаАгрегации", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаАгрегация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаАгрегации";
	НовыйЭлемент.Доступность = Ложь;
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ФайлЗагрузки", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ФайлЗагрузки";
	
	Элементы.Переместить(ЭтотОбъект.Элементы.гф_ФайлЗагрузки, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	
	// -- Плотников 22.06.2022
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ТекущийОрдер", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ТекущийОрдер";
	
	Элементы.Переместить(ЭтотОбъект.Элементы.гф_ТекущийОрдер, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	// #wortmann {
	// Галфинд Волков 20.03.2023
	// Не требуется вставка данного реквизита
	//// #wortmann {
	//// #3.3.33
	//// Галфинд Окунев 2022/07/05
	//	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_АдресДоставки", ТипПолеФормы, Элементы.ШапкаЛево);
	//	
	//	НовыйЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
	//	НовыйЭлемент.ПутьКДанным	= "Объект.гф_АдресДоставки";
	//// } #wortmann
	// } #wortmann

КонецПроцедуры     

&НаКлиенте
Процедура гф_КомплектацияПриИзменении(Элемент)
	
	Если Объект.Товары.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("гф_ПоказатьВопросЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, 
			"Табличная часть ""Товары"" будет очищена. 
			|Продолжить?", 
			РежимДиалогаВопрос.ДаНетОтмена, 
			30, 
			КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьТоварыПоВариантуКомплектации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура гф_ЗаказПриИзменении(Элемент) 
	// ++ Галфинд_ДомнышеваКР_06_03_2024
	ЗаполнитьКлиента();
	// -- Галфинд_ДомнышеваКР_06_03_2024	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура гф_ПоказатьВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТоварыПоВариантуКомплектации();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварыПоВариантуКомплектации()
	ЗаполнитьТоварыПоВариантуКомплектацииНаСервере();
	Элементы.ТоварыГруппаКартинкаНомерСтроки.Видимость = Ложь;
	Элементы.ТоварыНомерСтроки.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоВариантуКомплектацииНаСервере()
	
	Объект.Товары.Очистить();
	Комплектация = Объект.гф_Комплектация;
	
	Если ЗначениеЗаполнено(Комплектация) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Комплектация.НомерСтроки КАК НомерСтроки,
		|	Комплектация.Номенклатура КАК Номенклатура,
		|	Комплектация.Характеристика КАК Характеристика,
		|	Комплектация.Упаковка КАК Упаковка,
		|	Комплектация.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Комплектация.Количество КАК Количество,
		|	ИСТИНА КАК ХарактеристикиИспользуются,
		|	ЛОЖЬ КАК ЭтоУпаковочныйЛист
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК Комплектация
		|ГДЕ
		|	Комплектация.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Комплектация);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			ТаблицаТовары = Результат.Выгрузить();
			Объект.Товары.Загрузить(ТаблицаТовары);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКлиента()
	// ++ Галфинд_ДомнышеваКР_06_03_2024
	Если ТипЗнч(Объект.гф_Заказ) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
		ЭтотОбъект.гф_Клиент = Объект.гф_Заказ.гф_Партнер;
	Иначе
		ЭтотОбъект.гф_Клиент = Объект.гф_Заказ.Партнер;	
	КонецЕсли;
	// -- Галфинд_ДомнышеваКР_06_03_2024
КонецПроцедуры

&НаСервере
Процедура гф_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	// ++ Галфинд_ДомнышеваКР_06_03_2024
	Если ЗначениеЗаполнено(Объект.гф_Заказ) Тогда
		ЗаполнитьКлиента();
	КонецЕсли;
    // -- Галфинд_ДомнышеваКР_06_03_2024
КонецПроцедуры

#КонецОбласти
